//=============================================
//  객체 지향 프로그래밍(  Object Oriented Programing) 
//=============================================
//  객체 ( Object )
//  --  행동 +  속성 = 객체 
//  --  고유한 속성을 갖고 속성을 유지하지위한 능동적인 행동을 갖는 그
//      어떤 것이든 객체가 될 수 있다.

//	--  속성 :  정량적인 수치로 표현가능한 객체의 구성요소들... 
//	--  행동 :  객체가 수행할수 있는 기능  

//    - 학생   (사람 )
//	   속성 :  학번, 나이, 이름, 성적, 학과, 지도교수... 
//	   행동 :  수업, 공부, 과제, 시험, 여행 

//    - 핸드폰 ( 사물)
//	   속성 : 일련번호 ,  전화번호,  통신사, 단말기종류 , 화면크기, 메모리용량 
//		행동 : 전화통화 ,  문자메시지,  인터넷, 알람, 메모... 

//    - 봄     (계절 ) 
//		  속성 : 기간 , 기온,  습도, 꽃들, 일교차  
//		  행동 : 황사 , 편서풍 .. 

//	  - 산불   ( 재해)  
//		   속성 : 피해면적, 발생지, 발생시간, 규모 
//		   행동 : 연기나다. 이동이다. 대피경보...  


//    - 태풍   ( 자연현상 ) 
	//  속성 : 풍속, 기압, 규모, 이름, 이동경로, 강수량 ,  
	//  행동 :  생성, 소멸 ,이동, 바람, 천둥번개, 비  

//	  - 강의   ( 상황  ) 
	// 속성 : 강사, 수강생 ,시작시간, 종료시간, 장소, 시수 
	// 행동 :  시작, 종료 , 쉬는 시간. 질의응답, 실습, 이론.. 

//    - 사랑   ( 감정 ) 



public class OOP1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
